package it.saimao.shan_converter.breakers;

import org.junit.Assert;
import org.junit.Test;

import static org.junit.jupiter.api.Assertions.*;

public class ShanRuleBasedSyllableSegmentationTest {
    @org.junit.Test
    public void Test1() {
        Assert.assertEquals("ၵ ၶႃ ငီ ၸေ ၸႄ တူ ထူဝ် သေႃ လိုဝ် ဢိူဝ်", ShanRuleBasedSyllableSegmentation.segment("ၵၶႃငီၸေၸႄတူထူဝ်သေႃလိုဝ်ဢိူဝ်"));
        Assert.assertEquals("ဢ ၶႃး လီႊ ၸေႉ မႄႈ ထူး လူဝ်ႇ သေႃး လိုဝ်ႉ ပိူဝ်ႈ", ShanRuleBasedSyllableSegmentation.segment("ဢၶႃးလီႊၸေႉမႄႈထူးလူဝ်ႇသေႃးလိုဝ်ႉပိူဝ်ႈ"));
    }

    @org.junit.Test
    public void Test2() {
        Assert.assertEquals("ဢႆ ဢၢႆ ဢုၺ် ဢူၺ် ၵွႆ ဢိုၺ် ဢိူၺ်", ShanRuleBasedSyllableSegmentation.segment("ဢႆဢၢႆဢုၺ်ဢူၺ်ၵွႆဢိုၺ်ဢိူၺ်"));
        Assert.assertEquals("ၶၢႆ ၵႂၢႆး တူၺ်း သူၺ်ႊ လိုၺ်ႉ ႁိူၺ်ႉ", ShanRuleBasedSyllableSegmentation.segment("ၶၢႆၵႂၢႆးတူၺ်းသူၺ်ႊလိုၺ်ႉႁိူၺ်ႉ"));
    }

    @org.junit.Test
    public void Test3() {
        Assert.assertEquals("ၵၵ်ႇ လၢၵ်ႊ လိၵ်ႈ ၾဵၵ်ႉ လႅၵ်ႈ ၽုၵ်ႇ ဢူၵ် တွၵ်ႈ တိုၵ်း လိူၵ်ႈ", ShanRuleBasedSyllableSegmentation.segment("ၵၵ်ႇလၢၵ်ႊလိၵ်ႈၾဵၵ်ႉလႅၵ်ႈၽုၵ်ႇဢူၵ်တွၵ်ႈတိုၵ်းလိူၵ်ႈ"));
        Assert.assertEquals("ၸတ် လၢတ်ႈ သိတ် လဵတ် မႅတ်ႈ သုတ်ႉ လူတ်ႇ ၵွတ်း ဢိုတ်း လိူတ်ႈ", ShanRuleBasedSyllableSegmentation.segment("ၸတ်လၢတ်ႈသိတ်လဵတ်မႅတ်ႈသုတ်ႉလူတ်ႇၵွတ်းဢိုတ်းလိူတ်ႈ"));
        Assert.assertEquals("ပပ်ႉ လၢပ်ႊ ဢိပ်ႉ လဵပ်ႈ ၵျႅပ်ႉ ဢုပ်ႇ ထူပ်း ၵွပ်ႈ ဢိုပ်း ႁိူပ်ႊ", ShanRuleBasedSyllableSegmentation.segment("ပပ်ႉလၢပ်ႊဢိပ်ႉလဵပ်ႈၵျႅပ်ႉဢုပ်ႇထူပ်းၵွပ်ႈဢိုပ်းႁိူပ်ႊ"));
    }

    @org.junit.Test
    public void Test4() {
        Assert.assertEquals("ဢမ်ႇ ဢၢမ်ႊ သိမ်း ပဵမ်ႉ ၵႅမ်ႉ သုမ်း လူမ်း ၶွမ်း လိုမ်ႉ ၽိူမ်ႉ", ShanRuleBasedSyllableSegmentation.segment("ဢမ်ႇဢၢမ်ႊသိမ်းပဵမ်ႉၵႅမ်ႉသုမ်းလူမ်းၶွမ်းလိုမ်ႉၽိူမ်ႉ"));
        Assert.assertEquals("ဢၼ် ဢၢၼ်ႇ လိၼ် လဵၼ်ႈ လႅၼ်ႊ ဢုၼ်ႇ ဢူၼ် ဢွၼ်ႇ ပိုၼ်း ပိူၼ်ႈ", ShanRuleBasedSyllableSegmentation.segment("ဢၼ်ဢၢၼ်ႇလိၼ်လဵၼ်ႈလႅၼ်ႊဢုၼ်ႇဢူၼ်ဢွၼ်ႇပိုၼ်းပိူၼ်ႈ"));
        Assert.assertEquals("သင် ၵၢင်ႊ လိင်း ၶဵင်ႇ လႅင်း ဢုင်ႊ လူင်း ဢွင် ၶိုင် ၶိူင်ႊ", ShanRuleBasedSyllableSegmentation.segment("သင်ၵၢင်ႊလိင်းၶဵင်ႇလႅင်းဢုင်ႊလူင်းဢွင်ၶိုင်ၶိူင်ႊ"));
    }

    @org.junit.Test
    public void Test5() {
        Assert.assertEquals("ၶႂၢင်း ပၼ် ႁဝ်း ဢိတ်း ၼိုင်ႈ", ShanRuleBasedSyllableSegmentation.segment("ၶႂၢင်းပၼ်ႁဝ်းဢိတ်းၼိုင်ႈ"));
        Assert.assertEquals("မႂ်ႇ သုင် မိူင်း တႆး ႁႂ်ႈ ၸဵဝ်း ၵတ်း ယဵၼ်", ShanRuleBasedSyllableSegmentation.segment("မႂ်ႇသုင်မိူင်းတႆး ႁႂ်ႈၸဵဝ်းၵတ်းယဵၼ်"));
        Assert.assertEquals("ၼိူဝ် လိၼ် မီး လိၼ် ၼိူဝ် ၾႃႉ မီး ၾႃႉ သူ သမ်ႉ တေ ၵႂႃႇ ၶွႆ ၽႂ် ႁူၺ်း", ShanRuleBasedSyllableSegmentation.segment("ၼိူဝ်လိၼ် မီးလိၼ် ၼိူဝ်ၾႃႉ မီးၾႃႉ သူသမ်ႉတေၵႂႃႇၶွႆၽႂ်ႁူၺ်း"));
        Assert.assertEquals("တူဝ် မႂ်း မီး ႁိမ်း ပီႈ ၵေႃႈ သူင်ႇ ဢွၵ်ႇ ၸႂ် ႁၵ်ႉ မႂ်း မီး တီႈ ၵႆ", ShanRuleBasedSyllableSegmentation.segment("တူဝ်မႂ်းမီးႁိမ်းပီႈၵေႃႈ သူင်ႇဢွၵ်ႇၸႂ်ႁၵ်ႉ မႂ်းမီးတီႈၵႆ"));
        Assert.assertEquals("ၼႂ်း ၸႂ် တႄႉ ဝူၼ်ႉ သွၼ်ႇ ၵူဝ် ပဵၼ် လွင်ႈ ၽိတ်း ပိူင်ႈ", ShanRuleBasedSyllableSegmentation.segment("ၼႂ်းၸႂ်တႄႉ ဝူၼ်ႉသွၼ်ႇ ၵူဝ်ပဵၼ်လွင်ႈၽိတ်းပိူင်ႈ"));
    }

    @Test
    public void Test6_Pangram() {
        Assert.assertEquals("ပေႃး ၶႂ်ႈ ၵျ ၶႅၼ်ႇ ၵႂႃႇ ၸိုင် တေ လႆႈ ႁွင်ႉ သြႃႇ လီ ရဵၼ်း ႁူႉ သွၼ် ၽိုၵ်း ၺႃး မိူဝ်ႈ ၾႃႉ ပၢင်ႇ ၸၢႆး သၢင်ႇ လႄႈ ယိင်း ဢိူၺ်ႉ ပေ ၼိုၵ်း သိူဝ်း ၵျေႃႇ တိုၵ်း ထႃႈ ၸံ လႄႈ တင်း ၵႆ ၼၼ်ႉ သႃႊ",
                ShanRuleBasedSyllableSegmentation.segment("ပေႃးၶႂ်ႈၵျၶႅၼ်ႇၵႂႃႇၸိုင် တေလႆႈႁွင်ႉသြႃႇလီရဵၼ်းႁူႉသွၼ်ၽိုၵ်း ၺႃးမိူဝ်ႈၾႃႉပၢင်ႇ ၸၢႆးသၢင်ႇလႄႈ ယိင်းဢိူၺ်ႉပေၼိုၵ်း သိူဝ်းၵျေႃႇတိုၵ်းထႃႈ ၸံလႄႈတင်းၵႆၼၼ်ႉသႃႊ"));
    }


    @Test
    public void Test7_Phrase1() {
        Assert.assertEquals("""
                        ၸၢတ်ႈ ၸိုင်ႈ လုမ်ႈ ၾႃႉ ၼႆႉ မၼ်း ပဵၼ် ၸုမ်း ဢၼ် ဢမ်ႇ ၸႂ်ႈ လူင် ပွင် ၸိုင်ႈ သေ ပဵၼ် ၸုမ်း ဢၼ် ယႂ်ႇ သေ ပိူၼ်ႈ တွၼ်ႈ တႃႇ ထိင်း သိမ်း လွင်ႈ ငမ်း ယဵၼ် လႄႈ လွင်ႈ ႁူမ်ႇ လူမ်ႈ ၵူႈ ၸိုင်ႈ မိူင်း ၊ တွၼ်ႈ တႃႇ ၵေႃႇ သၢင်ႈ လွင်ႈ ၵပ်း သိုပ်ႇ ၸမ် ၸႂ် ၵၼ် ၼႂ်း ၵႄႈ မိူင်း တေႃႇ မိူင်း ၼၼ်ႉ ယဝ်ႉ ။ [ 2 ] ၸၢတ်ႈ ၸိုင်ႈ လုမ်ႈ ၾႃႉ ဢၼ် ႁွင်ႉ ဝႃႈ ယူႇ ဢႅၼ်ႇ ၼႆႉ မီး ဝႆႉ တီႈ ဝဵင်း ၼိဝ်း ယွၵ်ႉ ဢွင်ႈ တီႈ ၼႃႈ လိၼ် ဢၼ် ၵဵဝ်ႇ လူၺ်ႈ ၵူႈ ၸိုင်ႈ မိူင်း သေ ၸိူဝ်း ပဵၼ် လုမ်း ပိူင် လူင် မၼ်း တႄႉ မီး ဝႆႉ တီႈ ၵျ ၼီႇ ဝႃႇ ၊ ၼၢႆႇ ရူဝ်း ပီႇ ၊ ဝီႇ ယိၼ်ႇ ၼႃႇ ၸႄႈ ႁဵၵ်ႉ ၸိူဝ်း ၼႆႉ ယဝ်ႉ ။
                        """.strip(),
                ShanRuleBasedSyllableSegmentation.segment("""
                        ၸၢတ်ႈၸိုင်ႈလုမ်ႈၾႃႉ ၼႆႉ မၼ်းပဵၼ်ၸုမ်းဢၼ်ဢမ်ႇၸႂ်ႈ လူင်ပွင်ၸိုင်ႈသေ ပဵၼ်ၸုမ်းဢၼ်ယႂ်ႇသေပိူၼ်ႈ တွၼ်ႈတႃႇ ထိင်းသိမ်းလွင်ႈငမ်းယဵၼ် လႄႈ လွင်ႈႁူမ်ႇလူမ်ႈ ၵူႈၸိုင်ႈမိူင်း၊ တွၼ်ႈတႃႇၵေႃႇသၢင်ႈ လွင်ႈၵပ်းသိုပ်ႇၸမ်ၸႂ်ၵၼ် ၼႂ်းၵႄႈ မိူင်းတေႃႇမိူင်းၼၼ်ႉယဝ်ႉ။[2] ၸၢတ်ႈၸိုင်ႈလုမ်ႈၾႃႉ ဢၼ်ႁွင်ႉဝႃႈ ယူႇဢႅၼ်ႇၼႆႉ မီးဝႆႉတီႈဝဵင်းၼိဝ်းယွၵ်ႉ ဢွင်ႈတီႈၼႃႈလိၼ်ဢၼ်ၵဵဝ်ႇလူၺ်ႈ ၵူႈၸိုင်ႈမိူင်းသေ ၸိူဝ်းပဵၼ်လုမ်းပိူင်လူင်မၼ်းတႄႉ မီးဝႆႉတီႈ ၵျၼီႇဝႃႇ၊ ၼၢႆႇရူဝ်းပီႇ၊ ဝီႇယိၼ်ႇၼႃႇ ၸႄႈ ႁဵၵ်ႉ ၸိူဝ်းၼႆႉယဝ်ႉ။
                        """));
    }

    @Test
    public void Test8_Phrase2() {
        Assert.assertEquals(
                """
                        ၸၢတ်ႈ ၸိုင်ႈ လုမ်ႈ ၾႃႉ ၼႆႉ ဝၢႆး သေ သိုၵ်း ၵမ်ႇ ၽႃႇ ပွၵ်ႈ သွင် ယဝ်ႉ တူဝ်ႈ ယဝ်ႉ လႆႈ ယိူင်း ဢၢၼ်း ဝႃႈ တွၼ်ႈ တႃႇ ၵႅတ်ႇ ၵင်ႈ သိုၵ်း မိူဝ်း ၼႃႈ လႄႈ လႆႈ ယိူင်း ဢၢၼ်း ပဵၼ် ၸုမ်း ငဝ်ႈ ၸိုင်ႈ ဢၼ် ဢမ်ႇ ၸၢင်ႈ တိူဝ်ႉ ယမ် ၼၼ်ႉ သေ ၸင်ႇ လႆႈ ၵေႃႇ တင်ႈ မႃး ယဝ်ႉ ။ [ 3 ] မိူဝ်ႈ ပီ 1 9 4 5 လိူၼ် ဢေႇ ပ ရႄႇ 2 5 ဝၼ်း ၼၼ်ႉ လူင် ပွင် ၸိုင်ႈ 5 0 လႆႈ ႁူပ်ႉ ထူပ်း ၵၼ် တီႈ ပၢင် ၵုမ် သၼ်ႇ ၽ ရၢၼ်ႇ သိတ်ႇ သ ၵူဝ်ႇ သေ လႆႈ ဢွၼ် ၵၼ် တႄႇ တႅမ်ႈ c h a r t e r ပ တိၼ်ႇ ၺၢၼ်ႇ ၸၢတ်ႈ ၸိုင်ႈ လုမ်ႈ ၾႃႉ မႃး ယဝ်ႉ ။ ဢၼ် ၼၼ်ႉ ၼႆႉ လႆႈ တႄႇ ၸိူဝ်ႉ ၽၼ်း မၼ်း မႃး မိူဝ်ႈ ပီ 1 9 4 5 လိူၼ် ၵျုၼ်ႇ 2 5 သေ ထိုင် မႃး 1 9 4 5 လိူၼ် ဢွၵ်ႇ ထူဝ်ႇ ပႃႇ 2 4 မႃး ၸၢတ်ႈ ၸိုင်ႈ လုမ်ႈ ၾႃႉ လႆႈ တႄႇ သၢင်ႈ ၵၢၼ် မႃး ယဝ်ႉ ။ [ 4 ] ၸွမ်း လူၺ်ႈ ၽိုၼ် လိၵ်ႈ ပ တိၼ်ႇ ၺၢၼ်ႇ သေ တၢင်း ယိူင်း ဢၢၼ်း ၸုမ်း ၼႆႉ ပဵၼ် တွၼ်ႈ တႃႇ လွင်ႈ ငမ်း ယဵမ် လႄႈ လွင်ႈ ႁူမ်ႇ လူမ်ႈ ၵူႈ ၸိုင်ႈ မိူင်း ၊ တွၼ်ႈ တႃႇ ၵႅတ်ႇ ၶေ ႁႄႉ ၵင်ႈ သုၼ်ႇ လႆႈ သုၼ်ႇ ပဵၼ် ၵူၼ်း ၊ တွၼ်ႈ တႃ ပၼ် တၢင်း ၸွႆႈ ထႅမ် လွင်ႈ တူၺ်း ထိုင် ၵူၼ်း ၸ ၵႂႃႇ ၸိူဝ်း ၼႆႉ သေ ၽွင်း တႄႇ တင်ႈ ၼၼ်ႉ မိူင်း ၶဝ်ႈ ပဵၼ် လုၵ်ႈ ၸုမ်း မီး ၵႂႃႇ 5 1 မိူင်း ယဝ်ႉ ။ ထိုင် ပီ 2 0 1 1 ဝၢႆး သေ လႆႈ ဢဝ် မိူင်း သူႇ တၼ်ႇ ၸၢၼ်း သႂ်ႇ ယဝ်ႉ လုၵ်ႈ ၸုမ်း မီး ၵႂႃႇ 1 9 3 မိူင်း သေ မၼ်း တၢင် တူဝ် ၸိူဝ်း ပဵၼ် မိူင်း ဢၼ် မီး ဢႃႇ ၼႃႇ ပၢၼ်ႇ ပွင် ၸိုင်ႈ မိူင်း တင်း သဵင်ႈ ၼၼ်ႉ ယူႇ ယဝ်ႉ ။
                        """.strip(),
                ShanRuleBasedSyllableSegmentation.segment("""
                        ၸၢတ်ႈၸိုင်ႈလုမ်ႈၾႃႉ ၼႆႉ ဝၢႆးသေ သိုၵ်းၵမ်ႇၽႃႇပွၵ်ႈသွင်ယဝ်ႉတူဝ်ႈယဝ်ႉ လႆႈယိူင်းဢၢၼ်းဝႃႈ တွၼ်ႈတႃႇ ၵႅတ်ႇၵင်ႈသိုၵ်းမိူဝ်းၼႃႈ လႄႈ လႆႈယိူင်းဢၢၼ်းပဵၼ် ၸုမ်းငဝ်ႈၸိုင်ႈ ဢၼ်ဢမ်ႇၸၢင်ႈတိူဝ်ႉယမ်ၼၼ်ႉသေ ၸင်ႇလႆႈၵေႃႇတင်ႈမႃးယဝ်ႉ။[3] မိူဝ်ႈပီ 1945 လိူၼ်ဢေႇပရႄႇ 25 ဝၼ်းၼၼ်ႉ လူင်ပွင်ၸိုင်ႈ 50 လႆႈႁူပ်ႉထူပ်းၵၼ်တီႈ ပၢင်ၵုမ်သၼ်ႇၽရၢၼ်ႇသိတ်ႇသၵူဝ်ႇသေ လႆႈဢွၼ်ၵၼ်တႄႇတႅမ်ႈ charter ပတိၼ်ႇၺၢၼ်ႇ ၸၢတ်ႈၸိုင်ႈလုမ်ႈၾႃႉမႃးယဝ်ႉ။ ဢၼ်ၼၼ်ႉၼႆႉ လႆႈတႄႇၸိူဝ်ႉၽၼ်းမၼ်းမႃး မိူဝ်ႈပီ 1945 လိူၼ်ၵျုၼ်ႇ 25 သေ ထိုင်မႃး 1945 လိူၼ်ဢွၵ်ႇထူဝ်ႇပႃႇ 24 မႃး ၸၢတ်ႈၸိုင်ႈလုမ်ႈၾႃႉ လႆႈတႄႇသၢင်ႈၵၢၼ်မႃးယဝ်ႉ။[4] ၸွမ်းလူၺ်ႈၽိုၼ်လိၵ်ႈပတိၼ်ႇၺၢၼ်ႇသေ တၢင်းယိူင်းဢၢၼ်း ၸုမ်းၼႆႉ ပဵၼ်တွၼ်ႈတႃႇ လွင်ႈငမ်းယဵမ် လႄႈ လွင်ႈႁူမ်ႇလူမ်ႈ ၵူႈၸိုင်ႈမိူင်း၊ တွၼ်ႈတႃႇ ၵႅတ်ႇၶေႁႄႉၵင်ႈ သုၼ်ႇလႆႈသုၼ်ႇပဵၼ်ၵူၼ်း၊ တွၼ်ႈတႃ ပၼ်တၢင်းၸွႆႈထႅမ် လွင်ႈတူၺ်းထိုင်ၵူၼ်း ၸၵႂႃႇၸိူဝ်းၼႆႉသေ ၽွင်းတႄႇတင်ႈၼၼ်ႉ မိူင်းၶဝ်ႈပဵၼ်လုၵ်ႈၸုမ်း မီးၵႂႃႇ 51 မိူင်းယဝ်ႉ။ ထိုင်ပီ 2011 ဝၢႆးသေ လႆႈဢဝ် မိူင်းသူႇတၼ်ႇၸၢၼ်း သႂ်ႇယဝ်ႉ လုၵ်ႈၸုမ်း မီးၵႂႃႇ 193 မိူင်းသေ မၼ်းတၢင်တူဝ် ၸိူဝ်းပဵၼ်မိူင်းဢၼ်မီးဢႃႇၼႃႇပၢၼ်ႇပွင်ၸိုင်ႈမိူင်းတင်းသဵင်ႈၼၼ်ႉယူႇယဝ်ႉ။
                        """)
        );
    }

    @Test
    public void Test9_Phrase3() {
        Assert.assertEquals("""
                        သိူဝ် ၼႆႉ ၵမ်ႉ ပႃႈ ၼမ် ယၢဝ်း ယူႇ မွၵ်ႈ 1 1 ထတ်း ( ပေႇ ) သေ ၼမ်ႉ ၼၵ်း မီး မွၵ်ႈ 3 3 0 ၵီႇ လူဝ်ႇ ၵ ရမ်ႇ ( 6 6 0 ပွၼ်း ) ။ ငႃး သိူဝ် ၼႆႉ ၵမ်ႉ ပႃႈ ၼမ် ယၢဝ်း ယူႇ မွၵ်ႈ 4 သိၵ်ႈ ( i n c h s ) ။ သိူဝ် မၢင် တူဝ် ၸၢင်ႈ ယၢဝ်း လိူဝ် ၼၼ်ႉ ယူႇ ။ တမ်ႈ တီႈ သ ၽႃႇ ဝ ၼႂ်း ထိူၼ်ႇ ၼၼ်ႉ သိူဝ် ၼႆႉ ဢႃႇ ယု ၶဝ် ယူႇ သဝ်း လႆႈ မွၵ်ႈ 1 0 ပီ တေႃႇ 1 5 ပီ ။ ပေႃး ဝႃႈ ဢဝ် ၶဝ် မႃး ၶင် သေ လဵင်ႉ ဝႆႉ ၸိုင် ဢႃႇ ယု ၶဝ် ယူႇ ထိုင် လႆႈ 2 0 ပီ လႆႈ ႁၼ် ၼင်ႇ ၼႆ ။ သၢင်ႇ သီႈ ၼႆႉ ဢုပ်ႉ ငမ်း ဝႆႉ တမ်ႈ တီႈ ၼႂ်း ထိူၼ်ႇ ဢႃႇ ၽ ရ ၵ ၼင်ႇ ၼၼ် သိူဝ် ၵေႃႈ ပဵၼ် တူဝ် ဢၼ် ၵွၼ်း ဢုပ်ႉ ဝႆႉ ၼႂ်း ထိူၼ်ႇ ဢေး သျႃး ယဝ်ႉ ။ ၵူၼ်း ႁဝ်း ဢွၼ် ၵၼ် ဝႃႈ " မႅဝ်း ပဵၼ် သြႃႇ သိူဝ် " ၼႆ လႄႈ တေ လႆႈ ဝႃႈ သိူဝ် ၼႆႉ ပဵၼ် ၸၢဝ်း မႅဝ်း ၵူၺ်း ၼင်ႇ ၵဝ်ႇ ။ ပေႃး ဢဝ် မႅဝ်း လႄႈ သိူဝ် မႃး တႅၵ်ႈ ၵၼ် တူၺ်း ၸိုင် ၶႂ်ႈ လႆႈ ဝႃႈ မိူၼ် ၵၼ် ၵူႈ တီႈ ။ ဢၼ် ပိူင်ႈ ၵၼ် ၵူၺ်း မီး တူဝ် လဵၵ်ႉ လႄႈ တူဝ် ယႂ်ႇ ၵူၺ်း ။
                        """.strip(),
                ShanRuleBasedSyllableSegmentation.segment("""
                        သိူဝ်ၼႆႉ ၵမ်ႉပႃႈၼမ် ယၢဝ်းယူႇမွၵ်ႈ 11 ထတ်း(ပေႇ)သေ ၼမ်ႉၼၵ်းမီးမွၵ်ႈ 330 ၵီႇလူဝ်ႇၵရမ်ႇ (660 ပွၼ်း)။ ငႃးသိူဝ်ၼႆႉ ၵမ်ႉပႃႈၼမ် ယၢဝ်းယူႇမွၵ်ႈ 4 သိၵ်ႈ(inchs) ။ သိူဝ်မၢင်တူဝ် ၸၢင်ႈယၢဝ်းလိူဝ်ၼၼ်ႉယူႇ။ တမ်ႈတီႈ သၽႃႇဝၼႂ်းထိူၼ်ႇၼၼ်ႉ သိူဝ်ၼႆႉ ဢႃႇယုၶဝ် ယူႇသဝ်းလႆႈ မွၵ်ႈ 10 ပီ တေႃႇ 15 ပီ။ ပေႃးဝႃႈ ဢဝ်ၶဝ်မႃးၶင်သေ လဵင်ႉဝႆႉၸိုင် ဢႃႇယုၶဝ် ယူႇထိုင်လႆႈ 20 ပီ လႆႈႁၼ်ၼင်ႇၼႆ။ သၢင်ႇသီႈၼႆႉ ဢုပ်ႉငမ်းဝႆႉ တမ်ႈတီႈ ၼႂ်းထိူၼ်ႇ ဢႃႇၽရၵၼင်ႇၼၼ် သိူဝ်ၵေႃႈ ပဵၼ်တူဝ်ဢၼ် ၵွၼ်းဢုပ်ႉဝႆႉ ၼႂ်းထိူၼ်ႇဢေးသျႃးယဝ်ႉ။ ၵူၼ်းႁဝ်းဢွၼ်ၵၼ်ဝႃႈ "မႅဝ်းပဵၼ်သြႃႇသိူဝ်"ၼႆလႄႈ တေလႆႈဝႃႈ သိူဝ်ၼႆႉ ပဵၼ်ၸၢဝ်းမႅဝ်းၵူၺ်းၼင်ႇၵဝ်ႇ။ ပေႃးဢဝ် မႅဝ်းလႄႈသိူဝ် မႃးတႅၵ်ႈၵၼ်တူၺ်းၸိုင် ၶႂ်ႈလႆႈဝႃႈ မိူၼ်ၵၼ်ၵူႈတီႈ။ ဢၼ်ပိူင်ႈၵၼ် ၵူၺ်းမီး တူဝ်လဵၵ်ႉလႄႈ တူဝ်ယႂ်ႇၵူၺ်း။
                        """));
    }

    @Test
    public void Test10_Phrase3_Thailand() {
        Assert.assertEquals("""
                        မိူင်း ႁေႃ ၶမ်း ထႆး ( ရၢꩡ်ႉ ဢႃႇ ၼႃႇ ၸၵ်ႈ ထႆး ) ၼႆႉ ပဵၼ် မိူင်း ၵွၼ်း ၶေႃ မိူင်း ၼိူင်ႈ ဢၼ် မီး ဝႆႉ တီႈ လမ်ႇ လွင်ႈ ၼႂ်း တွၼ်ႈ ၸဵင်ႇ ၸၢၼ်း ဝၼ်း ဢွၵ်ႇ ဢေး သျႃး ။ ၾၢႆႇ ႁွင်ႇ ၼၼ်ႉ မီး မိူင်း မၢၼ်ႈ လႄႈ မိူင်း လၢဝ်း ၊ ၾၢႆႇ ဝၼ်း ဢွၵ်ႇ ၼၼ်ႉ မီး မိူင်း လၢဝ်း လႄႈ မိူင်း ၵမ်ႇ ပေႃး တီး ယႃး ၊ ၾၢႆႇ ၸၢၼ်း တႄႉ မီး ၵိဝ်ႇ ၼမ်ႉ ထႆး လႄႈ မိူင်း မ လေး သျႃး ၊ ၾၢႆႇ ဝၼ်း တူၵ်း တႄႉ မီး ပၢင်ႇ လၢႆႇ ဢႅတ်ႇ မႅၼ်ႇ လႄႈ မိူင်း မၢၼ်ႈ ၶဝ် လွမ်ႉ ႁွပ်ႈ မိူင်း ထႆး ဝႆႉ ။ လႅၼ်ႊ ၼမ်ႉ မိူင်း ထႆး ၼႆႉ ၾၢႆႇ ၵိဝ်ႇ ၼမ်ႉ ထႆး ၸဵင်ႇ ၸၢၼ်း ဝၼ်း ဢွၵ်ႇ ၼၼ်ႉ တိတ်း ၸပ်း ၵၼ် ဝႆႉ တင်း လႅၼ်ႊ ၼမ်ႉ မိူင်း ဝႅတ်ႉ ၼၢမ်း ၊ ၾၢႆႇ ပၢင်ႇ လၢႆႇ ဢႅတ်ႇ မႅၼ်ႇ ၸဵင်ႇ ၸၢၼ်း ဝၼ်း တူၵ်း ၼၼ်ႉ တိတ်း ၸပ်း ၵၼ် ဝႆႉ တင်း လႅၼ်ႊ ၼမ်ႉ မိူင်း ဢိၼ်ႇ တူဝ်ႇ ၼီး သျႃး လႄႈ မိူင်း ဢိၼ်ႇ တိ ယ ၶဝ် ယဝ်ႉ ။ ၵုင်း ထဵပ်ႈ ( မိူင်း ၵွၵ်ႇ ) ၼႆႉ ပဵၼ် ဝဵင်း လူင် ငဝ်ႈ ၸိုင်ႈ မိူင်း ထႆး သေ ဢမ်ႇ ၵႃး ပဵၼ် ဝဵင်း ဢၼ် ယႂ်ႇ သေ ပိူၼ်ႈ ၼႂ်း မိူင်း ထႆး ။ ၵုင်း ထဵပ်ႈ ၼႆႉ ပဵၼ် ဝဵင်း ငဝ်ႈ ငႃႇ တႃႇ ၵၢၼ် မိူင်း ၊ ၵၢၼ် မၢၵ်ႈ မီး ၊ ၵၢၼ် ႁဵတ်း ဢွၵ်ႇ ၶူဝ်း ၵုၼ်ႇ လႄႈ ၵၢၼ် ၾၢႆႇ ၾိင်ႈ ထုင်း ယဵၼ်ႇ ငႄႈ ၸိူဝ်း ၼၼ်ႉ ဝဵင်း ၼိူင်ႈ ယဝ်ႉ ။ } }
                        """.strip(),
                ShanRuleBasedSyllableSegmentation.segment("""
                        မိူင်းႁေႃၶမ်းထႆး (ရၢꩡ်ႉဢႃႇၼႃႇၸၵ်ႈထႆး) ၼႆႉ ပဵၼ်မိူင်းၵွၼ်းၶေႃ မိူင်းၼိူင်ႈ ဢၼ်မီးဝႆႉ တီႈလမ်ႇလွင်ႈ ၼႂ်းတွၼ်ႈ ၸဵင်ႇၸၢၼ်းဝၼ်းဢွၵ်ႇ ဢေးသျႃး။ ၾၢႆႇႁွင်ႇၼၼ်ႉမီး မိူင်းမၢၼ်ႈလႄႈ မိူင်းလၢဝ်း၊ ၾၢႆႇဝၼ်းဢွၵ်ႇၼၼ်ႉ မီး မိူင်းလၢဝ်း လႄႈ မိူင်းၵမ်ႇပေႃးတီးယႃး၊ ၾၢႆႇၸၢၼ်းတႄႉမီး ၵိဝ်ႇၼမ်ႉထႆး လႄႈ မိူင်းမလေးသျႃး၊ ၾၢႆႇဝၼ်းတူၵ်းတႄႉ မီး ပၢင်ႇလၢႆႇဢႅတ်ႇမႅၼ်ႇ လႄႈ မိူင်းမၢၼ်ႈ ၶဝ်လွမ်ႉႁွပ်ႈ မိူင်းထႆးဝႆႉ။ လႅၼ်ႊၼမ်ႉမိူင်းထႆးၼႆႉ ၾၢႆႇၵိဝ်ႇၼမ်ႉထႆး ၸဵင်ႇၸၢၼ်းဝၼ်းဢွၵ်ႇၼၼ်ႉ တိတ်းၸပ်းၵၼ်ဝႆႉတင်း လႅၼ်ႊၼမ်ႉ မိူင်းဝႅတ်ႉၼၢမ်း၊ ၾၢႆႇပၢင်ႇလၢႆႇဢႅတ်ႇမႅၼ်ႇ ၸဵင်ႇၸၢၼ်းဝၼ်းတူၵ်းၼၼ်ႉ တိတ်းၸပ်းၵၼ်ဝႆႉတင်း လႅၼ်ႊၼမ်ႉ မိူင်းဢိၼ်ႇတူဝ်ႇၼီးသျႃး လႄႈ မိူင်းဢိၼ်ႇတိယ ၶဝ်ယဝ်ႉ။ ၵုင်းထဵပ်ႈ (မိူင်းၵွၵ်ႇ) ၼႆႉ ပဵၼ်ဝဵင်းလူင်ငဝ်ႈၸိုင်ႈ မိူင်းထႆးသေဢမ်ႇၵႃး ပဵၼ်ဝဵင်းဢၼ်ယႂ်ႇသေပိူၼ်ႈ ၼႂ်းမိူင်းထႆး။ ၵုင်းထဵပ်ႈၼႆႉ ပဵၼ်ဝဵင်းငဝ်ႈငႃႇ တႃႇၵၢၼ်မိူင်း၊ ၵၢၼ်မၢၵ်ႈမီး၊ ၵၢၼ်ႁဵတ်းဢွၵ်ႇၶူဝ်းၵုၼ်ႇ လႄႈ ၵၢၼ်ၾၢႆႇၾိင်ႈထုင်းယဵၼ်ႇငႄႈ ၸိူဝ်းၼၼ်ႉ ဝဵင်းၼိူင်ႈယဝ်ႉ။}}
                        """));
    }

}