package it.saimao.shan_converter.detector;

import it.saimao.shan_converter.dectector.ShanLangDetector;
import org.junit.Test;

import static it.saimao.shan_converter.dectector.ShanLangDetector.isShanUnicode;
import static org.junit.Assert.assertFalse;
import static org.junit.Assert.assertTrue;

public class ShanLangDetectorTest {

    @Test
    public void Test1() {
        assertFalse("Detect if the input text is shan zawgyi or not", ShanLangDetector.isShanZawgyi("ၵ ဝႃႈ ၵႆႇ ၵွပ်ႈတႆႇမႆႉၼိူဝ်ၵွၼ်း။"));
        assertFalse("Detect if the input text is shan zawgyi or not", ShanLangDetector.isShanZawgyi("ၶ ဝႃႈ ၶႆႇ မႄႈမၼ်းပႆႇမႃးငွမ်း။"));
        assertFalse("Detect if the input text is shan zawgyi or not", ShanLangDetector.isShanZawgyi("င ဝႃႈ ငူး လိူၼ်ႈမႃးၸူးတူဝ်ၶဵတ်ႇ။"));
        assertTrue("Detect if the input text is shan zawgyi or not", ShanLangDetector.isShanZawgyi("ꨀ ဝꨣꨳ ꨀꨯꨲ ꨀြပ္ꨳတꨯꨲမꨯꨵꨓိူဝ္ꨀြꨓ္း။"));
        assertTrue("Detect if the input text is shan zawgyi or not", ShanLangDetector.isShanZawgyi("င ဝꨣꨳ ငူး လိူꨓ္ꨳမꨣးꨅူးတူဝ္ꨁꨱတ္ꨲ။"));
        assertTrue("Detect if the input text is shan zawgyi or not", ShanLangDetector.isShanZawgyi(" ꨁ ဝꨣꨳ ꨁꨯꨲ ꨬမꨳမꨓ္းပꨯꨲမꨣးငြမ္း။"));
    }

    @Test
    public void Test2_IsShanUnicode_AssertFalse() {
        assertFalse("ၵ ဝႃႈ ၵႆႇ ၵွပ်ႈတႆႇမႆႉၼိူဝ်ၵွၼ်း။ ၶ ဝႃႈ ၶႆႇ မႄႈမၼ်းပႆႇမႃးငွမ်း။ င ဝႃႈ ငူး လိူၼ်ႈမႃးၸူးတူဝ်ၶဵတ်ႇ။", isShanUnicode("ꨀ ဝꨣꨳ ꨀꨯꨲ ꨀြပ္ꨳတꨯꨲမꨯꨵꨓိူဝ္ꨀြꨓ္း။ ꨁ ဝꨣꨳ ꨁꨯꨲ ꨬမꨳမꨓ္းပꨯꨲမꨣးငြမ္း။ င ဝꨣꨳ ငူး လိူꨓ္ꨳမꨣးꨅူးတူဝ္ꨁꨱတ္ꨲ။"));
        assertFalse("ၸ ဝႃႈ ၸၢင်ႉ ပႆဢူင်ႉဢၢင်ႉၸွမ်းတၢင်း။ သ ဝႃႈ သိူဝ် မီးယူႇၼိူဝ်လႃႇႁႃႉ။ ၺ ဝႃႈ ၺွင်း သဵင်ၵွင်မွင်းပၼ်းၸွတ်ႇ", isShanUnicode("ꨅ ဝꨣꨳ ꨅꨤင္ꨵ ပꨯꨡူင္ꨵꨡꨤင္ꨵꨅြမ္းတꨤင္း။ သ ဝꨣꨳ သိူဝ္ မီးယူꨲꨓိူဝ္လꨣꨲꨟꨣꨵ။ ꨉ ဝꨣꨳ ꨉြင္း သꨱင္ꨀြင္မြင္းပꨓ္းꨅြတ္ꨲ"));
        assertFalse("တ ဝႃႈ တဝ်ႇ တီႈယူႇၵဝ်ႇ ႁိမ်းၼွင်။ ထ ဝႃႈ ထႆ တမ်းယႆဝႆႉသၢမ်မၢၵ်ႈ။ ၼ ဝႃႈ ၼူ မေႃးၸူၸူၸွမ်းၸွၵ်ႉ။", isShanUnicode("တ ဝꨣꨳ တဝ္ꨲ တီꨳယူꨲꨀဝ္ꨲ ꨟိမ္းꨓြင္။ ထ ဝꨣꨳ ထꨯ တမ္းယꨯဝꨯꨵသꨤမ္မꨤꨀ္ꨳ။ ꨓ ဝꨣꨳ ꨓူ ေမꨣးꨅူꨅူꨅြမ္းꨅြꨀ္ꨵ။"));
        assertFalse("ပ ဝႃႈ ပႃ ဢႅဝ်ႇလုၺ်းႁႃၵိၼ်ယိူဝ်ႇ။ ၽ ဝႃႈ ၽိုင်ႈ ၽွမ်ႉလုပ်ႇယိုင်ႈႁဵတ်းႁူင်း။ ၾ ဝႃႈ ၾႃႉ ၼႆႉပဵၼ်ၾႃႉၵၢင်ႁၢဝ်။", isShanUnicode("ပ ဝꨣꨳ ပꨣ ꨡꨰဝ္ꨲလုꨉ္းꨟꨣꨀိꨓ္ယိူဝ္ꨲ။ ꨕ ဝꨣꨳ ꨕိုင္ꨳ ꨕြမ္ꨵလုပ္ꨲယိုင္ꨳꨟꨱတ္းꨟူင္း။ ꨘ ဝꨣꨳ ꨘꨣꨵ ꨓꨯꨵပꨱꨓ္ꨘꨣꨵꨀꨤင္ꨟꨤဝ္။"));
        assertFalse("မ ဝႃႈ မႄႈ သွၼ်ယဵၼ်ႇငႄႈလုၵ်ႈလၢင်း။ ယ ဝႃႈ ယုင်း ၵၢင်သုတ်းမုင်းၸင်ႇလွတ်ႈ။ ရ ဝႃႈ ရဵၼ်း ဢၢၼ်ႇသွၼ်ႁဵၼ်းတီႈပွင်ႇ။", isShanUnicode("မ ဝꨣꨳ ꨬမꨳ သြꨓ္ယꨱꨓ္ꨲꨬငꨳလုꨀ္ꨳလꨤင္း။ ယ ဝꨣꨳ ယုင္း ꨀꨤင္သုတ္းမုင္းꨅင္ꨲလြတ္ꨳ။ ရ ဝꨣꨳ ရꨱꨓ္း ꨡꨤꨓ္ꨲသြꨓ္ꨟꨱꨓ္းတီꨳပြင္ꨲ။"));
        assertFalse("လ ဝႃႈ လေႃႉ ႁေႃႈၵႂႃႇတေႃႉၶူဝ်းသူၼ်။ ဝ ဝႃႈ ဝူဝ်း တူဝ်တေႃႉၶူဝ်းၵႂႃႇၵၢတ်ႇ။ ႁ ဝႃႈ ႁိူဝ်း ဝၢႆႈလတ်းမိူဝ်းၶၢမ်ႈတႃႈ။ ဢ ဝႃႈ ဢွႆႈ ၸဵမ်းၸွႆႈၸွႆႈၵိၼ်ဝၢၼ်။", isShanUnicode("လ ဝꨣꨳ ေလꨣꨵ ေꨟꨣꨳꨀꨮꨣꨲေတꨣꨵꨁူဝ္းသူꨓ္။ ဝ ဝꨣꨳ ဝူဝ္း တူဝ္ေတꨣꨵꨁူဝ္းꨀꨮꨣꨲꨀꨤတ္ꨲ။ ꨟ ဝꨣꨳ ꨟိူဝ္း ဝꨤꨯꨳလတ္းမိူဝ္းꨁꨤမ္ꨳတꨣꨳ။ ꨡ ဝꨣꨳ ꨡြꨯꨳ ꨅꨱမ္းꨅြꨯꨳꨅြꨯꨳꨀိꨓ္ဝꨤꨓ္။"));
    }

    @Test
    public void Test3_IsShanUnicode_AssertTrue() {
        assertTrue("ꨀ ဝꨣꨳ ꨀꨯꨲ ꨀြပ္ꨳတꨯꨲမꨯꨵꨓိူဝ္ꨀြꨓ္း။ ꨁ ဝꨣꨳ ꨁꨯꨲ ꨬမꨳမꨓ္းပꨯꨲမꨣးငြမ္း။ င ဝꨣꨳ ငူး လိူꨓ္ꨳမꨣးꨅူးတူဝ္ꨁꨱတ္ꨲ။", isShanUnicode("ၵ ဝႃႈ ၵႆႇ ၵွပ်ႈတႆႇမႆႉၼိူဝ်ၵွၼ်း။ ၶ ဝႃႈ ၶႆႇ မႄႈမၼ်းပႆႇမႃးငွမ်း။ င ဝႃႈ ငူး လိူၼ်ႈမႃးၸူးတူဝ်ၶဵတ်ႇ။"));
        assertTrue("ꨅ ဝꨣꨳ ꨅꨤင္ꨵ ပꨯꨡူင္ꨵꨡꨤင္ꨵꨅြမ္းတꨤင္း။ သ ဝꨣꨳ သိူဝ္ မီးယူꨲꨓိူဝ္လꨣꨲꨟꨣꨵ။ ꨉ ဝꨣꨳ ꨉြင္း သꨱင္ꨀြင္မြင္းပꨓ္းꨅြတ္ꨲ။", isShanUnicode("ၸ ဝႃႈ ၸၢင်ႉ ပႆဢူင်ႉဢၢင်ႉၸွမ်းတၢင်း။ သ ဝႃႈ သိူဝ် မီးယူႇၼိူဝ်လႃႇႁႃႉ။ ၺ ဝႃႈ ၺွင်း သဵင်ၵွင်မွင်းပၼ်းၸွတ်ႇ။"));
        assertTrue("တ ဝꨣꨳ တဝ္ꨲ တီꨳယူꨲꨀဝ္ꨲ ꨟိမ္းꨓြင္။ ထ ဝꨣꨳ ထꨯ တမ္းယꨯဝꨯꨵသꨤမ္မꨤꨀ္ꨳ။ ꨓ ဝꨣꨳ ꨓူ ေမꨣးꨅူꨅူꨅြမ္းꨅြꨀ္ꨵ။", isShanUnicode("တ ဝႃႈ တဝ်ႇ တီႈယူႇၵဝ်ႇ ႁိမ်းၼွင်။ ထ ဝႃႈ ထႆ တမ်းယႆဝႆႉသၢမ်မၢၵ်ႈ။ ၼ ဝႃႈ ၼူ မေႃးၸူၸူၸွမ်းၸွၵ်ႉ။"));
        assertTrue("ပ ဝꨣꨳ ပꨣ ꨡꨰဝ္ꨲလုꨉ္းꨟꨣꨀိꨓ္ယိူဝ္ꨲ။ ꨕ ဝꨣꨳ ꨕိုင္ꨳ ꨕြမ္ꨵလုပ္ꨲယိုင္ꨳꨟꨱတ္းꨟူင္း။ ꨘ ဝꨣꨳ ꨘꨣꨵ ꨓꨯꨵပꨱꨓ္ꨘꨣꨵꨀꨤင္ꨟꨤဝ္။", isShanUnicode("ပ ဝႃႈ ပႃ ဢႅဝ်ႇလုၺ်းႁႃၵိၼ်ယိူဝ်ႇ။ ၽ ဝႃႈ ၽိုင်ႈ ၽွမ်ႉလုပ်ႇယိုင်ႈႁဵတ်းႁူင်း။ ၾ ဝႃႈ ၾႃႉ ၼႆႉပဵၼ်ၾႃႉၵၢင်ႁၢဝ်။"));
        assertTrue("မ ဝꨣꨳ ꨬမꨳ သြꨓ္ယꨱꨓ္ꨲꨬငꨳလုꨀ္ꨳလꨤင္း။ ယ ဝꨣꨳ ယုင္း ꨀꨤင္သုတ္းမုင္းꨅင္ꨲလြတ္ꨳ။ ရ ဝꨣꨳ ရꨱꨓ္း ꨡꨤꨓ္ꨲသြꨓ္ꨟꨱꨓ္းတီꨳပြင္ꨲ။", isShanUnicode("မ ဝႃႈ မႄႈ သွၼ်ယဵၼ်ႇငႄႈလုၵ်ႈလၢင်း။ ယ ဝႃႈ ယုင်း ၵၢင်သုတ်းမုင်းၸင်ႇလွတ်ႈ။ ရ ဝႃႈ ရဵၼ်း ဢၢၼ်ႇသွၼ်ႁဵၼ်းတီႈပွင်ႇ။"));
        assertTrue("လ ဝꨣꨳ ေလꨣꨵ ေꨟꨣꨳꨀꨮꨣꨲေတꨣꨵꨁူဝ္းသူꨓ္။ ဝ ဝꨣꨳ ဝူဝ္း တူဝ္ေတꨣꨵꨁူဝ္းꨀꨮꨣꨲꨀꨤတ္ꨲ။ ꨟ ဝꨣꨳ ꨟိူဝ္း ဝꨤꨯꨳလတ္းမိူဝ္းꨁꨤမ္ꨳတꨣꨳ။ ꨡ ဝꨣꨳ ꨡြꨯꨳ ꨅꨱမ္းꨅြꨯꨳꨅြꨯꨳꨀိꨓ္ဝꨤꨓ္။", isShanUnicode("လ ဝႃႈ လေႃႉ ႁေႃႈၵႂႃႇတေႃႉၶူဝ်းသူၼ်။ ဝ ဝႃႈ ဝူဝ်း တူဝ်တေႃႉၶူဝ်းၵႂႃႇၵၢတ်ႇ။ ႁ ဝႃႈ ႁိူဝ်း ဝၢႆႈလတ်းမိူဝ်းၶၢမ်ႈတႃႈ။ ဢ ဝႃႈ ဢွႆႈ ၸဵမ်းၸွႆႈၸွႆႈၵိၼ်ဝၢၼ်။"));

    }

}
